In [1]:
import pandas as pd
import numpy as np

In [2]:
names = ['name5', 'name6', 'name7']

df = pd.DataFrame({'names' : np.random.choice(names, size=15)})
name5 = df[df.names=='name5']
name6 = df[df.names=='name6']
name7 = df[df.names=='name7']

# Then: 
display(name5, name6, name7)

    names
2   name5
6   name5
7   name5
9   name5
11  name5
14  name5

    names
1   name6
3   name6
4   name6
8   name6
12  name6
13  name6

    names
0   name7
5   name7
10  name7

In [7]:
import sys
thismodule = sys.modules[__name__]
names = ['name1', 'name2', 'name3', 'name4']

df = pd.DataFrame({'names' : np.random.choice(names, size=15)})


for i in names:
    setattr(thismodule, i,df[df.names==i])

display(name1,name2,name3, name4)

    names
1   name1
4   name1
5   name1
6   name1
7   name1
9   name1
11  name1
14  name1

    names
8   name2
10  name2
12  name2

    names
13  name3

   names
0  name4
2  name4
3  name4

In [8]:
%whos

Variable     Type         Data/Info
-----------------------------------
df           DataFrame        names\n0   name4\n1  <...>me2\n13  name3\n14  name1
i            str          name4
name1        DataFrame        names\n1   name1\n4  <...>me1\n11  name1\n14  name1
name2        DataFrame        names\n8   name2\n10  name2\n12  name2
name3        DataFrame        names\n13  name3
name4        DataFrame       names\n0  name4\n2  name4\n3  name4
name5        DataFrame        names\n2   name5\n6  <...>me5\n11  name5\n14  name5
name6        DataFrame        names\n1   name6\n3  <...>me6\n12  name6\n13  name6
name7        DataFrame        names\n0   name7\n5   name7\n10  name7
names        list         n=4
np           module       <module 'numpy' from '/Us<...>kages/numpy/__init__.py'>
pd           module       <module 'pandas' from '/U<...>ages/pandas/__init__.py'>
sys          module       <module 'sys' (built-in)>
thismodule   module       <module '__main__'>

In [ ]:
Employee = type("Employee", (object,), dict())

employee = Employee()

# Set salary to 1000
setattr(employee,"salary", 1000 )

# Get the Salary
value = getattr(employee, "salary")

print(value)

In [ ]:
employee

In [ ]:
type(employee)

In [9]:
class test1():
    def __init__(self):

        self.name
        self.apellido

In [10]:
e = test1

In [11]:
setattr(e,"name", df )

In [13]:
e.name =1

In [14]:
e.name

1

In [16]:
a = 'f'
setattr(thismodule,a, df )

In [17]:
f

    names
0   name4
1   name1
2   name4
3   name4
4   name1
5   name1
6   name1
7   name1
8   name2
9   name1
10  name2
11  name1
12  name2
13  name3
14  name1